<?php

//$open_file = fopen('aa.txt','w');
//fwrite($open_file,1);

//echo file_get_contents("aa.txt");



// Easy Counter by dwthai.com
if(file_exists("aa.txt")){
// file_exists() คือ Func ที่ใช้ในการตรวจสอบไฟล์ หากไฟล์นั้นมีอยู่จริงจะคืนค่า true มาให้
    $f=fopen("aa.txt","r");
    /* fopen() เป็นการเปิดไฟล์ตามที่เราต้องการ และเราจำเป็นต้องกำหนด option ให้แก่การเปิดไฟลืด้วย option ต่าง ๆ มีดังนี้ r สำหรับการอ่านไฟล์ , w สำหรับการเขียนไฟล์ และข้อมูลจะถูกเขียนทับใหม่ทั้งหมด, a สำหรับการเขียนไฟล์ แต่ข้อมูลจะถูกเขียนต่อข้อมูลเดิมที่มีอยู่ในไฟล์นั้น
    */
    $data=fread($f,5); // fread() เป็นการอ่านไฟล์ เลข 5 คือจำนวน byte ที่ต้องการอ่านค่าออกมา
    fclose($f);



    $data++;
}else{
    $data=0;
}
$f=fopen("aa.txt","w");
fputs($f,$data);
fclose($f);

/*
%05d คือ option ที่ใช้งานการกำหนดรูปแบบของตัวเลข ส่วนของเลข 5 เราสามารถกำหนดได้ตามที่ต้องการ จะเป็นการกำหนดว่าให้เราใช้เลข 0 นำหน้าตัวเลขนั้นหากหลักของตัวเลขมีค่าน้อยกว่า 5 หลัก เป็นต้น
*/
echo sprintf("%05d",$data);// แสดงผล
?>